#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-7JqUZh3rD8Lp3yeV

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg=]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY=]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ=]
github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM=]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU=]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919 has been changed
  ~ resource "github_branch_protection" "repos_cdktfprovideraws_mainprotection_B7F72919" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderkubernetes_mainprotection_98A1BD1D" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"e617607905a016991dff279287e30e0aa0fa73fa7def31587216c6fe37099b80\"" -> "W/\"194fbc3ada834b6f650bb2008fc5a08b17afa3cf11c0869a71bdb6651c28d662\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E has been changed
  ~ resource "github_branch_protection" "repos_cdktfprovidergithub_mainprotection_D33DAB1E" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderrandom_mainprotection_A087F18D" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1 has been changed
  ~ resource "github_branch_protection" "repos_cdktfprovidergoogle_mainprotection_2D089CC1" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderdatadog_mainprotection_BEF61ED6" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderexternal_mainprotection_A8EFF040" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"8d56fe50af6aa3b4abbeaec3401f10e75e2dc4e87ba64afaa1829d5c0517123d\"" -> "W/\"2f62ecbe7b5eb8cada0e9ec3287902c56e1b60809a65540a91b741ee2ac6b03c\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderdocker_mainprotection_BFFE8D77" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderazurerm_mainprotection_C1C7E36E" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873 has been changed
  ~ resource "github_branch_protection" "repos_cdktfprovidernull_mainprotection_B3BB4873" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3 will be created
  + resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B will be created
  + resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF will be created
  + resource "github_actions_secret" "repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230 will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B will be created
  + resource "github_actions_secret" "repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC will be created
  + resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801 will be created
  + resource "github_actions_secret" "repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418 will be created
  + resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7 will be created
  + resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B will be created
  + resource "github_actions_secret" "repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33 will be created
  + resource "github_branch_protection" "repos_cdktfproviderarchive_mainprotection_71039C33" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-archive"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763 will be created
  + resource "github_branch_protection" "repos_cdktfproviderlocal_mainprotection_2BB09763" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-local"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071 will be created
  + resource "github_branch_protection" "repos_cdktfproviderpagerduty_mainprotection_18096071" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-pagerduty"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 will be created
  + resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for archive."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-archive"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "archive",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.repos_cdktfproviderlocal_repo_4D7B21AD will be created
  + resource "github_repository" "repos_cdktfproviderlocal_repo_4D7B21AD" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for local."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-local"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "local",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 will be created
  + resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for pagerduty."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-pagerduty"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "pagerduty",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B will be created
  + resource "github_team_repository" "repos_cdktfproviderarchive_managingteam_9F25FC7B" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-archive"
      + team_id    = "3949435"
    }

  # github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60 will be created
  + resource "github_team_repository" "repos_cdktfproviderlocal_managingteam_0280CE60" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-local"
      + team_id    = "3949435"
    }

  # github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F will be created
  + resource "github_team_repository" "repos_cdktfproviderpagerduty_managingteam_26C4AF5F" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-pagerduty"
      + team_id    = "3949435"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repos_providerRepos_C7679B58 = [
        # (9 unchanged elements hidden)
        "git@github.com:hashicorp/cdktf-provider-random.git",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "github-token" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*